Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/R08B.tmx
Source language: en_us
Languages: zh_cn

source: CRAZY GLUE
zh_cn: 疯狂胶水

source: 'What did you buy it for?'
zh_cn: “你买这个做什么？”

source: 'Because I need it,' she said.
zh_cn: “我需要它，”她说。

source: 'A lot of things around here need gluing.'
zh_cn: “这里有许多东西得黏起来。”

source: 'Nothing around here needs gluing,' I said.
zh_cn: “没东西需要黏，”我说。

source: 'I wish I understood why you buy all this stuff.''
zh_cn: “真希望我能理解为什么你总买这些东西。”

source: For the same reason I married you,' she murmured.
zh_cn: “和我嫁给你的理由一样，”她喃喃地说。

source: 'To help pass the time.'
zh_cn: “为了打发时间。”

source: I didn't want to fight, so I kept quiet, and so did she.
zh_cn: 我不想争吵，于是保持沉默，她也一样。

source: 'Is it any good, this glue?' I asked.
zh_cn: “这管胶水，有什么优点吗？”我问。

source: She showed me the picture on the box, with this guy hanging upside-down from the ceiling.
zh_cn: 她给我看了包装盒上的图片，上面有个家伙头朝下挂在天花板上。

source: 'No glue can really make a person stick like that,' I said.
zh_cn: “没有胶水能让一个人像那样黏着，”我说。

source: 'They just took the picture upside-down. They must have put a lamp on the floor.'
zh_cn: “他们只是把图片倒了一下，把灯安在地板上。”

source: I took the box from her and peered at it.
zh_cn: 我从她手中拿过盒子仔细端详。

source: 'And there, look at the window.
zh_cn: “看那里，窗户那儿。

source: They didn't even bother to hang the blinds the other way.
zh_cn: 他们甚至没把窗帘换个方向挂。

source: They're upside down, if he's really standing on the ceiling.
zh_cn: 窗帘颠倒了，要是他真的站在天花板上的话。

source: Look,' I said again, pointing to the window.
zh_cn: 看啊，”我重复了一遍，指着图里的窗户。

source: She didn't look.
zh_cn: 她没有看。

source: 'It's eight already,' I said.
zh_cn: “已经八点了，”我说。

source: 'I've got to run.'
zh_cn: “我得走了。”

source: I picked up my briefcase and kissed her on the cheek.
zh_cn: 我拿起公文包，亲了亲她的脸颊。

source: 'I'll be back pretty late.
zh_cn: “可能要很晚才能回来。

source: I'm working-'
zh_cn: 我的工作需要——”

source: 'Overtime,' she said.
zh_cn: “加班，”她说。

source: 'Yes, I know.'
zh_cn: “是的，我知道。”

source: I called Abby from the office.
zh_cn: 我在办公室里给艾比打了个电话。

source: 'I can't make it today,' I said.
zh_cn: “今天我来不了了，”我说。

source: 'I've got to get home early.'
zh_cn: “我得早点回家。”
